# QF627 Pre-Course Workshop | Introduction to Programming
## Lesson 03 | An Introduction to `pandas` Part 1 | `PRE`view

In [2]:
import pandas as pd
import numpy as np

In [2]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [3]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [2]:
vals1 = np.array([1, None, 3, 4])
print(vals1)

[1 None 3 4]

In [4]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [5]:
data.dropna()

0        1
2    hello
dtype: object

In [6]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [7]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [8]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [11]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [12]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [13]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [16]:
data = pd.Series([1, np.nan, 2, None, 3], index = list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [17]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [18]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [19]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [20]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [22]:
df.fillna(method='ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [13]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index = index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [26]:
pop[('New York', 2000):('Texas', 2010)]

(New York, 2000)    18976457
(New York, 2010)    19378102
(Texas, 2000)       20851820
(Texas, 2010)       25145561
dtype: int64

In [29]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [30]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [31]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [32]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [33]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [34]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [35]:
pop_df = pd.DataFrame({'total':pop, 'under18':[9267089, 9284094, 4687374, 4318033, 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [36]:
f_u18 = pop_df['under18']/pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [3]:
df = pd.DataFrame(np.random.rand(4,2), index=[['a', 'a','b','b'], [1,2,1,2]], columns=['data1', 'data2'])
df

        data1     data2
a 1  0.066564  0.307748
  2  0.149707  0.290154
b 1  0.281710  0.327002
  2  0.647584  0.080082

In [11]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [5]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [6]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [8]:
pd.MultiIndex.from_product([['a','b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [18]:
#pop.index.names = ['state', 'year']v

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

TypeError: MultiIndex.__new__() got an unexpected keyword argument 'labels'

In [8]:
type(vals1)

In [3]:
for dtype in ['object', 'int']:
    print('dtype = ', dtype)
    %timeit np.arange(1E6, dtype = dtype).sum()
    print()

dtype =  object
61.2 ms ± 6.53 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype =  int
1.57 ms ± 9.32 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [4]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [6]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [7]:
1+np.nan

nan

In [9]:
0+np.nan

nan

In [10]:
vals2.min(), vals2.max(), vals2.mean()

(nan, nan, nan)

In [12]:
np.nanmin(vals2), np.nanmax(vals2), np.nansum(vals2)

(1.0, 4.0, 8.0)

In [14]:
pd.Series([1, np.nan, 3, None])

0    1.0
1    NaN
2    3.0
3    NaN
dtype: float64

In [16]:
x = pd.Series(np.arange(2), dtype = int)
x

0    0
1    1
dtype: int32

In [17]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [1]:
import pandas

In [2]:
pandas.__version__

'1.5.3'

In [3]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
data = pd.Series([0.25, 0.5, 0.75, 1])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
data[1]

0.5

In [10]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [11]:
data = pd.Series([0.25, 0.5, 0.75, 1], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [12]:
data['a']

0.25

In [14]:
data = pd.Series([0.25, .5, .75, 1], index = [1, 2 ,3, 100])

In [15]:
data[100]

1.0

In [16]:
population_dict = {'California': 38332521, "Texas": a, "New York": 19651127, "Florida": 12882135, "Illinois": 19552860}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       12882135
Illinois      19552860
dtype: int64

In [17]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       12882135
dtype: int64

In [20]:
pd.Series(5, index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [21]:
pd.Series({2:'a', 24:'b', 3:'c'})

2     a
24    b
3     c
dtype: object

In [22]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [23]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[2,1])

2    a
1    b
dtype: object

In [24]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [25]:
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       12882135  170312
Illinois      19552860  149995

In [26]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [28]:
states.columns

Index(['population', 'area'], dtype='object')

In [29]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [31]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       12882135
Illinois      19552860

In [32]:
data = [{'a': i, 'b': 2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [34]:
pd.DataFrame([{'a':1, 'b': 3}, {'b': 2, 'c': 5}])

     a  b    c
0  1.0  3  NaN
1  NaN  2  5.0

In [35]:
pd.DataFrame({'population':population, 'area':area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       12882135  170312
Illinois      19552860  149995

In [36]:
pd.DataFrame(np.random.rand(3,2), columns=['foo'b
                                           , 'bar'], index=['a', 'b','c'])

        foo       bar
a  0.221675  0.587197
b  0.416700  0.731952
c  0.468957  0.871936

In [37]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [38]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [39]:
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [40]:
ind[1]

3

In [41]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [42]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [43]:
ind[0] = 9

TypeError: Index does not support mutable operations

In [44]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,9,11])

In [53]:
data = pd.Series([.25, .5, .75, 1], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [54]:
data['d']

1.0

In [55]:
'b' in data

True

In [56]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [59]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [60]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [61]:
data['a':'d']

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [62]:
data[0:1]

a    0.25
dtype: float64

In [64]:
data[(data>0.3) & (data< 0.8)]

b    0.50
c    0.75
dtype: float64

In [66]:
data[['a','e']]

a    0.25
e    1.25
dtype: float64

In [68]:
data = pd.Series(['a', 'b', 'c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [69]:
data[1]

'a'

In [70]:
data[1:3]

3    b
5    c
dtype: object

In [71]:
data.loc[1]

'a'

In [72]:
data.loc[3:5]

3    b
5    c
dtype: object

In [73]:
data.iloc[1]

'b'

In [75]:
data.iloc[0:2]

1    a
3    b
dtype: object

In [76]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

> Let's learn `pandas`!

> `pandas` is one of the most powerful and popular tools in dealing with data within Python.

> In finance, familiarity with pandas is essential. 

> We will work with real-world datasets containing both string and numeric data, often structured around time series.

> You will learn effective data manipulation, analysis, and visualization techniques with pandas.

> First, you will learn

- how to open and read in a csv spreadsheet
- how to look at the data we have
- how to select columns
- how to do some simple math with them

In [77]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [78]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [79]:
data.area is data['area']

True

In [80]:
data.pop is data['pop']

False

In [82]:
data['density'] = data['pop']/data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [83]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [84]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [85]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [86]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [87]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [88]:
data.loc[:'California', : 'density']

              area       pop    density
California  423967  38332521  90.413926

In [91]:
data.loc[data.density>100, ['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [92]:
data.iloc[0,2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [93]:
data['New York':'Illinois']

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [94]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [95]:
data[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [1]:
!pip install pandas

Requirement already satisfied: pandas in e:\software\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in e:\software\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in e:\software\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in e:\software\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in e:\software\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

> First we need to `import pandas as a library`. We import the library and then tell Python to refer to it as `pd`. By convention, it's imported as `pd` to save typing.

In [2]:
import pandas as pd

### Reading spreadsheets

> This is how you read a spreadsheet and assign it to an object. Reading in a CSV is just as easy as you'd guess.

In [4]:
our_data = pd.read_csv("2016_census_data.csv")
our_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4700 entries, 0 to 4699
Data columns (total 16 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   geoid                             4700 non-null   int64
 1   name                              4700 non-null   object
 2   county                            4700 non-null   object
 3   state                             4700 non-null   object
 4   total_population                  4700 non-null   int64
 5   median_income                     4700 non-null   int64
 6   median_home_value                 4700 non-null   int64
 7   educational_attainment            4700 non-null   int64
 8   white_alone                       4700 non-null   int64
 9   black_alone                       4700 non-null   int64
 10  native                            4700 non-null   int64
 11  asian                             4700 non-null   int64
 12  native_hawaiian_pacific_islander  4700 non-null   int64
 13  some_other_race_alone             4700 non-null   int64
 14  two_or_more                       4700 non-null   int64
 15  hispanic_or_latino                4700 non-null   int64
dtypes: int64(13), object(3)
memory usage: 587.6+ KB

### Looking at your data

> To look at the data you just read into Python, you can just run a cell with the name of the variable:

> Oops, that's a little long. Maybe we just want to see the first 10 rows:

> Or you might want to look at the last five:

> or you want to know the length of the entire set:

### Filtering by columns

> How about filtering your data by columns? This is how you can do that:

> Often, you might want to select multiple columns:

### Doing simple math with your data
> There are a few nifty functions you can apply to your data columns.

> There is also this nifty function which gives you a quick overview of your data:

### Making new data columns
> You can make a new column based on two columns like so:

> To overwrite your previous data you can just re-assign the column new values, the way you do with any variable:

##### A quick sorting function can now help you find the spots with the highest or lowest black populations (we can go over this again next week):

### Grouping your data results

`Thank you for working with the script.`